OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
typedef struct _lut_seq
{
    uint32_t lut[4];
} lut_seq_t;

enum
{
    kSerialNOR_IndividualMode = false,
    kSerialNOR_ParallelMode   = true,
};

enum
{
    kFlexSpiSerialClk_Update,
    kFlexSpiSerialClk_Restore,
};

/*! @brief NOR flash command sequence instruction for SFDP. */
enum
{
    kSerialFlash_ReadSFDP    = 0x5A,
    kSerialFlash_ReadJEDECId = 0x9F,
};

/*! @brief NOR flash manufacturer ID. */
enum
{
    kSerialNorFlash_MicronManufacturerID    = 0x20,
    kSerialNorFlash_MacronixManufacturerID  = 0xC2,
    kSerialNorFlash_Adesto128ManufacturerID = 0x1F,
    kSerialNorFlash_Adesto32ManufacturerID  = 0x43,
    kSerialNorFlash_IssiManufacturerID      = 0x9D,
    kSerialNorFlash_WinbondManufacturerID   = 0xEF,
};

/*! @brief Octal serial NOR flash command sequence instruction for SFDP. */
enum
{
    kOctalSerialFlash_ReadSFDP_1st    = 0x5A,
    kOctalSerialFlash_ReadSFDP_2nd    = 0x60,
    kOctalSerialFlash_ReadJEDECId_1st = 0x9F,
    kOctalSerialFlash_ReadJEDECId_2nd = 0xA5,
};

/*! @brief NOR flash SFDP header. */
typedef struct _sfdp_header
{
    uint32_t signature;
    uint8_t minor_rev;
    uint8_t major_rev;
    uint8_t param_hdr_num;
    uint8_t reserved;
} sfdp_header_t;

/*! @brief Function specific parameter table ID assignments. */
enum
{
    kParameterID_BasicSpiProtocal             = 0xFF00, /* Basic Flash Parameter Table */
    kParameterID_SectorMap                    = 0xFF81, /* Sector Map Table */
    kParameterID_RPMC                         = 0xFF03, /* Replay Protected Monotonic Counters */
    kParameterID_4ByteAddressInstructionTable = 0xFF84, /* 4-byte Address Instruction Table */
    kParameterID_XSPIProfileVersion1          = 0xFF05, /* eXtended Serial Peripheral Interface (xSPI) Profile 1.0 */
    kParameterID_XSPIProfileVersion2          = 0xFF06, /* eXtended Serial Peripheral Interface (xSPI) Profile 2.0 */
    kParameterID_SCCRM                        = 0xFF87, /* Status, Control and Configuration Register Map */
    kParameterID_SCCRMForMultiChipSPIMemoryDecive =
        0xFF88, /* Status, Control and Configuration Register Map Offsets for Multi-Chip SPI Memory Devices */
    kParameterID_SCCRMForxSPIProfileVersion2 =
        0xFF09, /* Status, Control and Configuration Register Map for xSPI Profile 2.0 */
    kParameterID_CommandSeqToOctalDDRMode = 0xFF0A, /* Command Sequences to change to Octal DDR (8D-8D-8D) mode */
    kParameterID_MSPT                     = 0xFF8B, /* Long Latency NVM Media Specific Parameter Table (MSPT) */
    kParameterID_ReservedTableAssignment  = 0xFF0C, /* Reserved for next Function Specific Table assignment */
};

/*! @brief SFDP Parameter Header. */
typedef struct _sfdp_parameter_header
{
    uint8_t parameter_id_lsb;
    uint8_t minor_rev;
    uint8_t major_rev;
    uint8_t table_length_in_32bit;
    uint8_t parameter_table_pointer[3];
    uint8_t parameter_id_msb;
} sfdp_parameter_header_t;

#define SFDP_PARAM_HEADER_ID(p) (((uint32_t)(p).parameter_id_msb << 8) | (p).parameter_id_lsb)
#define SFDP_PARAM_HEADER_PTP(p)                                                                          \
    (((uint32_t)(p).parameter_table_pointer[2] << 16) | ((uint32_t)(p).parameter_table_pointer[1] << 8) | \
     ((uint32_t)(p).parameter_table_pointer[0] << 0))

/*! @brief Basic Flash Parameter Table. */
typedef struct _jedec_basic_flash_param_table
{
    /* 1st DWORD */
    struct
    {
        uint32_t erase_size : 2;
        uint32_t write_granularity : 1;
        uint32_t vsr_block_protect : 1;
        uint32_t vsr_write_enable : 1;
        uint32_t unused0 : 3;
        uint32_t erase4k_inst : 8;
        uint32_t support_1_1_2_fast_read : 1;
        uint32_t address_bytes : 2;
        uint32_t support_dtr_clocking : 1;
        uint32_t support_1_2_2_fast_read : 1;
        uint32_t supports_1_4_4_fast_read : 1;
        uint32_t support_1_1_4_fast_read : 1;
        uint32_t unused1 : 9;
    } misc;

    /* 2nd DWORD */
    uint32_t flash_density;

    /* 3rd DWORD */
    struct
    {
        uint32_t dummy_clocks_1_4_4_read : 5;
        uint32_t mode_clocks_1_4_4_read : 3;
        uint32_t inst_1_4_4_read : 8;
        uint32_t dummy_clocks_1_1_4_read : 5;
        uint32_t mode_clocks_1_1_4_read : 3;
        uint32_t inst_1_1_4_read : 8;
    } read_1_4_info;

    /* 4th DWORD */
    struct
    {
        uint32_t dummy_clocks_1_1_2_read : 5;
        uint32_t mode_clocks_1_1_2_read : 3;
        uint32_t inst_1_1_2_read : 8;
        uint32_t dummy_clocks_1_2_2_read : 5;
        uint32_t mode_clocks_1_2_2_read : 3;
        uint32_t inst_1_2_2_read : 8;
    } read_1_2_info;

    /* 5th DWORD */
    struct
    {
        uint32_t support_2_2_2_fast_read : 1;
        uint32_t reserved0 : 3;
        uint32_t support_4_4_4_fast_read : 1;
        uint32_t reserved1 : 27;
    } read_22_44_check;

    /* 6th DWORD */
    struct
    {
        uint32_t reserved0 : 16;
        uint32_t dummy_clocks_2_2_2_read : 5;
        uint32_t mode_clocks_2_2_2_read : 3;
        uint32_t inst_2_2_2_read : 8;
    } read_2_2_info;

    /* 7th DWORD */
    struct
    {
        uint32_t reserved0 : 16;
        uint32_t dummy_clocks_4_4_4_read : 5;
        uint32_t mode_clocks_4_4_4_read : 3;
        uint32_t inst_4_4_4_read : 8;
    } read_4_4_info;

    /* 8st and 9th DWORD */
    struct
    {
        uint8_t size;
        uint8_t inst;
    } erase_info[4];

    /* 10th DWORD */
    struct
    {
        uint32_t multiplier_from_typical_to_max : 4;
        uint32_t type_1_count : 5;
        uint32_t type_1_units : 2;
        uint32_t type_2_count : 5;
        uint32_t type_2_units : 2;
        uint32_t type_3_count : 5;
        uint32_t type_3_units : 2;
        uint32_t type_4_count : 5;
        uint32_t type_4_units : 2;
    } erase_timing;

    /* 11th DWORD */
    struct
    {
        uint32_t program_max_time : 4;
        uint32_t page_size : 4;
        uint32_t page_program_time_count : 5;
        uint32_t page_program_time_units : 1;
        uint32_t byte_program_time_first_count : 4;
        uint32_t byte_program_time_first_units : 1;
        uint32_t byte_program_time_additional_count : 4;
        uint32_t byte_program_time_additional_units : 1;
        uint32_t chip_erase_time_count : 5;
        uint32_t chip_erase_time_units : 2;
        uint32_t reserved0 : 1;
    } chip_erase_progrm_info;

    /* 12th DWORD */
    struct
    {
        uint32_t prohibited_oprations_during_program_suspend : 4;
        uint32_t prohibited_oprations_during_erase_suspend : 4;
        uint32_t reserved0 : 1;
        uint32_t program_resume_2_suspend_interval : 4;
        uint32_t suspend_ipp_max_latency_count : 5;
        uint32_t suspend_ipp_max_latency_units : 2;
        uint32_t erase_resume_2_suspend_interval_count : 4;
        uint32_t suspend_ipe_max_latency_count : 5;
        uint32_t suspend_ipe_max_latency_units : 2;
        uint32_t support_suspend_resume : 1;
    } suspend_resume_info;

    /* 13th DWORD */
    struct
    {
        uint32_t program_resume_inst : 8;
        uint32_t program_suspend_inst : 8;
        uint32_t resume_inst : 8;
        uint32_t suspend_inst : 8;
    } suspend_resume_inst;

    /* 14th DWORD */
    struct
    {
        uint32_t reserved0 : 2;
        uint32_t busy_status_polling : 6;
        uint32_t delay_from_deep_powerdown_to_next_operation_count : 5;
        uint32_t delay_from_deep_powerdown_to_next_operation_units : 2;
        uint32_t exit_deep_powerdown_inst : 8;
        uint32_t enter_deep_powerdown_inst : 8;
        uint32_t support_deep_powerdown : 1;
    } deep_power_down_info;

    /* 15th DWORD */
    struct
    {
        uint32_t mode_4_4_4_disable_seq : 4;
        uint32_t mode_4_4_4_enable_seq : 5;
        uint32_t support_mode_0_4_4 : 1;
        uint32_t mode_0_4_4_exit_method : 6;
        uint32_t mode_0_4_4_entry_method : 4;
        uint32_t quad_enable_requirement : 3;
        uint32_t hold_reset_disable : 1;
        uint32_t reserved0 : 8;
    } mode_4_4_info;

    /* 16th DWORD */
    struct
    {
        uint32_t status_reg_write_enable : 7;
        uint32_t reserved0 : 1;
        uint32_t soft_reset_rescue_support : 6;
        uint32_t exit_4_byte_addressing : 10;
        uint32_t enter_4_byte_addrssing : 8;
    } mode_config_info;

    /* 17th DWORD */
    struct
    {
        uint32_t dummy_clocks_1_8_8_read : 5;
        uint32_t mode_clocks_1_8_8_read : 3;
        uint32_t inst_1_8_8_read : 8;
        uint32_t dummy_clocks_1_1_8_read : 5;
        uint32_t mode_clocks_1_1_8_read : 3;
        uint32_t inst_1_1_8_read : 8;
    } read_1_8_info;

    /* 18th DWORD */
    struct
    {
        uint32_t reserved0 : 18;
        uint32_t driver_strength : 5;
        uint32_t jedec_spi_protocal_reset : 1;
        uint32_t data_strobe_waveforms_str : 2;
        uint32_t data_strobe_support_qpi_str : 1;
        uint32_t data_strobe_support_qpi_dtr : 1;
        uint32_t reserved1 : 1;
        uint32_t octal_dtr_cmd_and_cmd_extension : 2;
        uint32_t byte_order_8_8_8 : 1;
    } octal_1_8_info;

