OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    /* 7th DWORD */
    // program error
    uint32_t program_error;

    /* 8th DWORD */
    // erase error
    uint32_t erase_error;

    /* 9th DWORD */
    // dummy cycles setting for volatile reg
    uint32_t yummy_cyclse_volatile;

    /* 10th DWORD */
    // dummy cycles setting for non-volatile reg
    uint32_t yummy_cyclse_nonvolatile;

    /* 11th DWORD */
    // dummy cycles setting for bit patterns
    uint32_t yummy_cyclse_bit_pattern;

    /* 12th DWORD */
    // dummy cycles setting for bit patterns
    uint32_t yummy_cyclse_bit_pattern2;

    /* 13th DWORD */
    // dummy cycles setting for bit patterns
    uint32_t yummy_cyclse_bit_pattern3;

    /* 14th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t qpi_bit_position : 3;
        uint32_t qpi_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t qpi_polarity : 1;
        uint32_t qpi_available : 1;
    } volatile_qpi_enable_info;

    /* 15th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t qpi_bit_position : 3;
        uint32_t qpi_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t qpi_polarity : 1;
        uint32_t qpi_available : 1;
    } non_volatile_qpi_enable_info;

    /* 16th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t octal_bit_position : 3;
        uint32_t octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t octal_polarity : 1;
        uint32_t octal_available : 1;
    } volatile_octal_enable_info;

    /* 17th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t octal_bit_position : 3;
        uint32_t octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t otp_bit : 1;
        uint32_t octal_polarity : 1;
        uint32_t octal_available : 1;
    } non_volatile_octal_enable_info;

    /* 18th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_dtr_bit_position : 3;
        uint32_t str_dtr_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_dtr_polarity : 1;
        uint32_t str_dtr_available : 1;
    } volatile_str_dtr_enable_info;

    /* 19th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_dtr_bit_position : 3;
        uint32_t str_dtr_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_dtr_polarity : 1;
        uint32_t str_dtr_available : 1;
    } non_volatile_str_dtr_enable_info;

    /* 20th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_octal_bit_position : 3;
        uint32_t str_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_octal_polarity : 1;
        uint32_t str_octal_available : 1;
    } volatile_str_octal_enable_info;

    /* 21th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_octal_bit_position : 3;
        uint32_t str_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_octal_polarity : 1;
        uint32_t str_octal_available : 1;
    } non_volatile_str_octal_enable_info;

    /* 22th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t dtr_octal_bit_position : 3;
        uint32_t dtr_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t dtr_octal_polarity : 1;
        uint32_t dtr_octal_available : 1;
    } volatile_dtr_octal_enable_info;

    /* 23th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t dtr_octal_bit_position : 3;
        uint32_t dtr_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t dtr_octal_polarity : 1;
        uint32_t dtr_octal_available : 1;
    } non_volatile_dtr_octal_enable_info;

    /* 24th DWORD */
    // dpd status
    uint32_t dpd_status;

    /* 25th DWORD */
    // udpd status
    uint32_t udpd_status;

    /* 26th DWORD */
    // output driver strength volatile
    uint32_t output_driver_strength;

    /* 27th DWORD */
    // output driver strength non-volatile
    uint32_t output_driver_strength_nv;

    /* 28th DWORD */
    // output driver strength control bit patterns
    uint32_t output_driver_strength_bit_pattern;
} jedec_sccr_table_t;

/*! @brief Status, Control and Configuration Register Map for xSPI Profile 2.0 Memory Devices. */
typedef struct _jedec_sccr_2_table
{
    /* 1st DWORD */
    uint32_t volatile_reg_address_offset;

    /* 2nd DWORD */
    uint32_t non_volatile_reg_address_offset;

    /* 3rd DWORD */
    uint32_t cmd_status_control;

    /* 4th DWARD */
    uint32_t program_error;

    /* 5th DWARD */
    uint32_t erase_error;

    /* 6th DWARD */
    uint32_t dummy_cycle_setting_volatile;

    /* 7th DWARD */
    uint32_t dummy_cycle_setting_nv;

    /* 8th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern1;

    /* 9th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern2;

    /* 10th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern3;

    /* 11th DWARD */
    uint32_t output_driver_strength_volatile;

    /* 12th DWARD */
    uint32_t output_driver_strength_nv;

    /* 13th DWARD */
    uint32_t output_driver_strength_bit_pattern;

} jedec_sccr_2_table_t;

/*! @brief Command Sequences to change to Octal DDR (8D-8D-8D) mode Instruction Table. */
typedef struct _jedec_octal_ddr_mode_inst_table
{
    /* 1st DWORD */
    struct
    {
        uint32_t byte_3_of_1st_command_seq : 8;
        uint32_t byte_2_of_1st_command_seq : 8;
        uint32_t byte_1_of_1st_command_seq : 8;
        uint32_t length_of_1st_command_seq : 8;
    } first_cmd_info_1st_dword;

    /* 2nd DWORD */
    struct
    {
        uint32_t byte_7_of_1st_command_seq : 8;
        uint32_t byte_6_of_1st_command_seq : 8;
        uint32_t byte_5_of_1st_command_seq : 8;
        uint32_t byte_4_of_1st_command_seq : 8;
    } first_cmd_info_2nd_dword;

    /* 3rd DWORD */
    struct
    {
        uint32_t byte_3_of_2nd_command_seq : 8;
        uint32_t byte_2_of_2nd_command_seq : 8;
        uint32_t byte_1_of_2nd_command_seq : 8;
        uint32_t length_of_2nd_command_seq : 8;
    } second_cmd_info_1st_dword;

