OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    /* 4th DWORD */
    struct
    {
        uint32_t byte_7_of_2nd_command_seq : 8;
        uint32_t byte_6_of_2nd_command_seq : 8;
        uint32_t byte_5_of_2nd_command_seq : 8;
        uint32_t byte_4_of_2nd_command_seq : 8;
    } second_cmd_info_2nd_dword;

    /* 5th DWORD */
    struct
    {
        uint32_t byte_3_of_3rd_command_seq : 8;
        uint32_t byte_2_of_3rd_command_seq : 8;
        uint32_t byte_1_of_3rd_command_seq : 8;
        uint32_t length_of_3rd_command_seq : 8;
    } third_cmd_info_1st_dword;

    /* 6th DWORD */
    struct
    {
        uint32_t byte_7_of_3rd_command_seq : 8;
        uint32_t byte_6_of_3rd_command_seq : 8;
        uint32_t byte_5_of_3rd_command_seq : 8;
        uint32_t byte_4_of_3rd_command_seq : 8;
    } third_cmd_info_2nd_dword;

    /* 7th DWORD */
    struct
    {
        uint32_t byte_3_of_4th_command_seq : 8;
        uint32_t byte_2_of_4th_command_seq : 8;
        uint32_t byte_1_of_4th_command_seq : 8;
        uint32_t length_of_4th_command_seq : 8;
    } fouth_cmd_info_1st_dword;

    /* 8th DWORD */
    struct
    {
        uint32_t byte_7_of_4th_command_seq : 8;
        uint32_t byte_6_of_4th_command_seq : 8;
        uint32_t byte_5_of_4th_command_seq : 8;
        uint32_t byte_4_of_4th_command_seq : 8;
    } fouth_cmd_info_2nd_dword;
} jedec_octal_ddr_mode_cmd_table_t;

typedef struct _jdec_query_table
{
    uint32_t standard_version;
    uint32_t basic_flash_param_tbl_size;
    jedec_basic_flash_param_table_t basic_flash_param_tbl;
    bool has_4b_addressing_inst_table;
    jedec_4byte_addressing_inst_table_t flash_4b_inst_tbl;
    jedec_xspi_profile_1_table_t xspi_profile_1_tb1;
    jedec_sccr_table_t sccr_tb1;
    jedec_sccr_2_table_t sccr_2_tb1;
    jedec_octal_ddr_mode_cmd_table_t octal_ddr_cmd_tb1;
} jedec_info_table_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t FLEXSPI_NOR_PrepareQuadModeEnableSequence(nor_handle_t *handle,
                                                          flexspi_mem_config_t *config,
                                                          jedec_info_table_t *tbl);
static status_t FLEXSPI_NOR_EnableQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config);

static status_t FLEXSPI_NOR_PreEnterOctalMode(nor_handle_t *handle,
                                              flexspi_mem_config_t *config,
                                              jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_MacronixEnterOctalMode(nor_handle_t *handle,
                                                   flexspi_mem_config_t *config,
                                                   jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_MacronixExitOctalMode(nor_handle_t *handle,
                                                  flexspi_mem_config_t *config,
                                                  jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_AdestoEnterOctalMode(nor_handle_t *handle,
                                                 flexspi_mem_config_t *config,
                                                 jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_ProbeCommandMode(nor_handle_t *handle, flexspi_mem_config_t *config);

static status_t FLEXSPI_NOR_CheckCommandModeAvailability(nor_handle_t *handle,
                                                         flexspi_mem_config_t *config,
                                                         jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_GenerateConfigBlockUsingSFDP(nor_handle_t *handle, flexspi_mem_config_t *config);

static status_t FLEXSPI_NOR_WaitBusBusy(FLEXSPI_Type *base, flexspi_mem_nor_handle_t *handle, uint32_t baseAddr);

static status_t FLEXSPI_NOR_WriteEnable(FLEXSPI_Type *base, flexspi_port_t port, uint32_t baseAddr);

static status_t FLEXSPI_NOR_ParseSFDP(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_GetPageSectorBlockSizeFromSFDP(nor_handle_t *handle,
                                                           jedec_info_table_t *tbl,
                                                           uint32_t *sector_erase_cmd,
                                                           uint32_t *block_erase_cmd);

status_t FLEXSPI_NOR_ExitNoCMDMode(nor_handle_t *handle, flexspi_mem_config_t *config, uint32_t baseAddr);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static status_t FLEXSPI_NOR_WaitBusBusy(FLEXSPI_Type *base, flexspi_mem_nor_handle_t *handle, uint32_t baseAddr)
{
    /* Wait status ready. */
    bool isBusy = true;
    uint32_t readValue;
    status_t status;
    flexspi_transfer_t flashXfer;

    flashXfer.deviceAddress = baseAddr;
    flashXfer.port          = handle->port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
    flashXfer.data          = &readValue;
    flashXfer.dataSize      = 1;

    do
    {
        status = FLEXSPI_TransferBlocking(base, &flashXfer);

        if (status != kStatus_Success)
        {
            return status;
        }

        if (handle->busyBitPolarity == 0x01U)
        {
            isBusy = (((~readValue) & (0x01UL << handle->busyOffset)) == (0x01UL << handle->busyOffset)) ? true : false;
        }
        else
        {
            isBusy = ((readValue & (0x01UL << handle->busyOffset)) == (0x01UL << handle->busyOffset)) ? true : false;
        }
    } while (isBusy);

    return status;
}

static status_t FLEXSPI_NOR_WriteEnable(FLEXSPI_Type *base, flexspi_port_t port, uint32_t baseAddr)
{
    flexspi_transfer_t flashXfer;
    status_t status;

    /* Write enable */
    flashXfer.deviceAddress = baseAddr;
    flashXfer.port          = port;
    flashXfer.cmdType       = kFLEXSPI_Command;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITEENABLE;

    status = FLEXSPI_TransferBlocking(base, &flashXfer);

