OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

static status_t FLEXSPI_NOR_GetPageSectorBlockSizeFromSFDP(nor_handle_t *handle,
                                                           jedec_info_table_t *tbl,
                                                           uint32_t *sector_erase_cmd,
                                                           uint32_t *block_erase_cmd)
{
    jedec_basic_flash_param_table_t *param_tbl        = &tbl->basic_flash_param_tbl;
    jedec_4byte_addressing_inst_table_t *flash_4b_tbl = &tbl->flash_4b_inst_tbl;

    uint32_t flashSize;
    uint32_t flashDensity = tbl->basic_flash_param_tbl.flash_density;

    if ((flashDensity & (1UL << 0x1F)) != 0x00U)
    {
        /* Flash size >= 4G bits */
        flashSize = 1UL << (flashDensity & ~(1UL << 0x1F));
    }
    else
    {
        /* Flash size < 4G bits */
        flashSize = flashDensity + 1U;
    }

    /* Convert to bytes. */
    flashSize >>= 3;

    handle->bytesInMemorySize = flashSize;

    /* Calculate Page size */
    uint32_t page_size;
    if (tbl->basic_flash_param_tbl_size < 64U)
    {
        handle->bytesInPageSize = 256U;
    }
    else
    {
        page_size               = 0x01UL << (param_tbl->chip_erase_progrm_info.page_size);
        handle->bytesInPageSize = (page_size == (0x01UL << 15)) ? 256UL : page_size;
    }

    /* Calculate Sector Size */
    uint32_t sectorSize      = 0xFFFFU;
    uint32_t blockSize       = 0x00U;
    uint32_t sectorEraseType = 0U;
    uint32_t blockEraseType  = 0U;
    uint8_t index;

    for (index = 0U; index < 4U; index++)
    {
        if (param_tbl->erase_info[index].size != 0UL)
        {
            uint32_t current_erase_size = 1UL << param_tbl->erase_info[index].size;
            /* Calculate min non-zero sector size */
            if ((current_erase_size < sectorSize) && (current_erase_size < (1024U * 1024U)))
            {
                sectorSize      = current_erase_size;
                sectorEraseType = index;
            }

            /* Calculate max non-zero sector size */
            if ((current_erase_size > blockSize) && (current_erase_size < (1024U * 1024U)))
            {
                blockEraseType = index;
            }
        }
    }

    handle->bytesInSectorSize = sectorSize;

    /* Calculate erase instruction operand for LUT */
    if ((flashSize > MAX_24BIT_ADDRESSING_SIZE) && (tbl->has_4b_addressing_inst_table))
    {
        *sector_erase_cmd = flash_4b_tbl->erase_inst_info.erase_inst[sectorEraseType];
        *block_erase_cmd  = flash_4b_tbl->erase_inst_info.erase_inst[blockEraseType];
    }
    else
    {
        *sector_erase_cmd = param_tbl->erase_info[sectorEraseType].inst;
        *block_erase_cmd  = param_tbl->erase_info[blockEraseType].inst;
    }

    return kStatus_Success;
}

static status_t FLEXSPI_NOR_ParseSFDP(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl)
{
    status_t status = kStatus_InvalidArgument;
    bool isSDRMode  = false;

    do
    {
        jedec_basic_flash_param_table_t *param_tbl        = &tbl->basic_flash_param_tbl;
        jedec_4byte_addressing_inst_table_t *flash_4b_tbl = &tbl->flash_4b_inst_tbl;
        jedec_xspi_profile_1_table_t *xspi_profile_1_tb1  = &tbl->xspi_profile_1_tb1;

        uint8_t read_cmd        = 0U;
        uint32_t dummy_cycles   = 0U;
        uint8_t mode_cycles     = 0U;
        uint32_t sectorEraseCmd = 0U;
        uint32_t blockEraseCmd  = 0U;
        uint32_t address_bits   = 24U;
        uint32_t address_pads   = kFLEXSPI_1PAD;
        bool support_ddr_mode   = false;

        /* Get page and sector information from SFDP. */
        FLEXSPI_NOR_GetPageSectorBlockSizeFromSFDP(handle, tbl, &sectorEraseCmd, &blockEraseCmd);

        if ((flexspiMemHandle.configuredFlashSize > MAX_24BIT_ADDRESSING_SIZE) && (tbl->has_4b_addressing_inst_table))
        {
            address_bits = 32;
        }

        /* Check whether octal command mode is supported or not. */
        bool supportOctalCmdMode = (param_tbl->mode_8_8_info.mode_8s_8s_8s_enable_seq != 0x00U) ? true : false;

        /* Check whether DDR transfer rate is supported or not. */
        support_ddr_mode = (param_tbl->misc.support_dtr_clocking != 0x00U) ? true : false;

        if (!supportOctalCmdMode)
        {
            /* Check whether DDR mode is supported. */
            if (config->deviceType == kSerialNorCfgOption_DeviceType_ReadSFDP_DDR)
            {
                if (!support_ddr_mode)
                {
                    break;
                }
            }
            else
            {
                support_ddr_mode = false;
            }

            /* Prepare Quad Mode enable sequence as needed. */
            status = FLEXSPI_NOR_PrepareQuadModeEnableSequence(handle, config, tbl);

            if (status != kStatus_Success)
            {
                break;
            }

            /* Determine Read command based on SFDP. */
            if (param_tbl->misc.supports_1_4_4_fast_read != 0x00U)
            {
                address_pads = (uint32_t)kFLEXSPI_4PAD;
                mode_cycles  = param_tbl->read_1_4_info.mode_clocks_1_4_4_read;
                dummy_cycles = param_tbl->read_1_4_info.dummy_clocks_1_4_4_read;
            }
            else if (param_tbl->misc.support_1_1_4_fast_read != 0x00U)
            {
                mode_cycles  = param_tbl->read_1_4_info.mode_clocks_1_1_4_read;
                dummy_cycles = param_tbl->read_1_4_info.dummy_clocks_1_1_4_read;
            }
            else
            {
                ;
            }

            /* Set page program instruction for LUT*/
            if (address_bits == 32U)
            {
                if (flash_4b_tbl->cmd_4byte_support_info.support_1_4_4_page_program != 0x00U)
                {
                    /*
                     * Page Program command for 1-4-4 mode based on 4 bytes address
                     * --------------------------------------------------------------
                     * Inst No.| Inst opcode | Inst num_pads | Inst oprand
                     * ==============================================================
                     * 0       | CMD_SDR     | 0x0 (Single)  | 0x3E
                     * --------------------------------------------------------------
                     * 1       | ADDR_SDR    | 0x2 (Quad)    | 0x20 (4 bytes address)
                     * --------------------------------------------------------------
                     * 2       | WRITE_SDR   | 0x2 (Quad)    | Any non-zero value
                     * --------------------------------------------------------------
                     * 3 ~ 7   | STOP (0x00) | 0x0 (Single)  | 0x00
                     * -------------------------------------------------------------- */
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_PageProgram_1_4_4_4B,
                                        kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 32);
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_4PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
                }
                else if (flash_4b_tbl->cmd_4byte_support_info.support_1_1_4_page_program != 0x00U)
                {
                    /*
                     * Page Program command for 1-1-4 mode based on 4 bytes address
                     * --------------------------------------------------------------
                     * Inst No.| Inst opcode | Inst num_pads | Inst oprand
                     * ==============================================================
                     * 0       | CMD_SDR     | 0x0 (Single)  | 0x01
                     * --------------------------------------------------------------
                     * 1       | ADDR_SDR    | 0x0 (Single)  | 0x20 (4 bytes address)
                     * --------------------------------------------------------------
                     * 2       | WRITE_SDR   | 0x2 (Quad)    | Any non-zero value
                     * --------------------------------------------------------------
                     * 3 ~ 7   | STOP (0x00) | 0x0 (Single)  | 0x00
                     * -------------------------------------------------------------- */
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_PageProgram_1_1_4_4B,
                                        kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32);
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_4PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
                }
                else
                {
                    /*
                     * Page Program command for 1-1-1 mode based on 4 bytes address
                     * --------------------------------------------------------------
                     * Inst No.| Inst opcode | Inst num_pads | Inst oprand
                     * ==============================================================
                     * 0       | CMD_SDR     | 0x0 (Single)  | 0x12
                     * --------------------------------------------------------------
                     * 1       | ADDR_SDR    | 0x0 (Single)  | 0x20 (4 bytes address)
                     * --------------------------------------------------------------
                     * 2       | WRITE_SDR   | 0x0 (Single)  | Any non-zero value
                     * --------------------------------------------------------------
                     * 3 ~ 7   | STOP (0x00) | 0x0 (Single)  | 0x00
                     * -------------------------------------------------------------- */
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_PageProgram_1_1_1_4B,
                                        kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32);
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
                }
            }
            else
            {
                /*
                 * Page Program command for 1-1-1 mode based on 3 bytes address
                 * --------------------------------------------------------------
                 * Inst No.| Inst opcode | Inst num_pads | Inst oprand
                 * ==============================================================
                 * 0       | CMD_SDR     | 0x0 (Single)  | 0x12
                 * --------------------------------------------------------------
                 * 1       | ADDR_SDR    | 0x0 (Single)  | 0x18 (3 bytes address)
                 * --------------------------------------------------------------
                 * 2       | WRITE_SDR   | 0x0 (Single)  | Any non-zero value
                 * --------------------------------------------------------------
                 * 3 ~ 7   | STOP (0x00) | 0x0 (Single)  | 0x00
                 * -------------------------------------------------------------- */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_PageProgram_1_1_1_3B,
                                    kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 24);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
            }

            /* Set write enable command instruction for LUT. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteEnable, kFLEXSPI_Command_STOP,
                                kFLEXSPI_1PAD, 0);

            /* Set read status command instruction for LUT. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0x04);

            /* Set sector erase command instruction for LUT. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASESECTOR] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, sectorEraseCmd, kFLEXSPI_Command_RADDR_SDR,
                                kFLEXSPI_1PAD, address_bits);

            /* Set sector erase command instruction for LUT. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, blockEraseCmd, kFLEXSPI_Command_RADDR_SDR,
                                kFLEXSPI_1PAD, address_bits);

            /* Set chip erase command instruction for LUT. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_CHIPERASE] = FLEXSPI_LUT_SEQ(
                kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ChipErase, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);

            /* Set read commmand instruction for LUT. */
            if (address_bits == 24U)
            {
                if (support_ddr_mode)
                {
                    read_cmd = kSerialNorCmd_kFLEXSPI_Command_READ_DDR_1_4_4_3B;
                }
                else if (param_tbl->misc.supports_1_4_4_fast_read != 0x00U)
                {
                    read_cmd = param_tbl->read_1_4_info.inst_1_4_4_read;
                }
                else if (param_tbl->misc.support_1_1_4_fast_read != 0x00U)
                {
                    read_cmd = param_tbl->read_1_4_info.inst_1_1_4_read;
                }
                else
                {
                    read_cmd     = kSerialNorCmd_BasicRead_3B;
                    dummy_cycles = 0;
                    mode_cycles  = 0;
                }
            }
            else
            {
                address_pads = (uint32_t)kFLEXSPI_4PAD;
                if (support_ddr_mode)
                {
                    read_cmd = kSerialNorCmd_kFLEXSPI_Command_READ_DDR_1_4_4_4B;
                }
                else if (flash_4b_tbl->cmd_4byte_support_info.support_1_4_4_fast_read != 0x00U)
                {
                    read_cmd = kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_4_4_4B;
                }
                else if (flash_4b_tbl->cmd_4byte_support_info.support_1_1_4_fast_read != 0x00U)
                {
                    read_cmd     = kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_1_4_4B;
                    address_pads = kFLEXSPI_1PAD;
                }
                else
                {
                    read_cmd     = kSerialNorCmd_BasicRead_4B;
                    dummy_cycles = 0;
                    mode_cycles  = 0;
                }
            }

            /* Set read command instruction for LUT. */
            if (support_ddr_mode)
            {
                config->controllerMiscOption |= (0x01UL << kFlexSpiMiscOffset_DdrModeEnable);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READ * 0U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, read_cmd, kFLEXSPI_Command_RADDR_DDR,
                                    kFLEXSPI_4PAD, address_bits);
                /* Dummy cycle is depending on flash device, different flash vendor has a different dummy cycle, this
                 * part will be updated. */
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READ * 0U + 1U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_DDR, kFLEXSPI_4PAD, (mode_cycles + dummy_cycles) * 2U,
                                    kFLEXSPI_Command_READ_DDR, kFLEXSPI_4PAD, 0x04);
            }
            else
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READ * 0U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, read_cmd, kFLEXSPI_Command_RADDR_SDR,
                                    address_pads, address_bits);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READ * 0U + 1U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_MODE8_SDR, kFLEXSPI_4PAD, mode_cycles, kFLEXSPI_Command_DUMMY_SDR,
                                    kFLEXSPI_4PAD, dummy_cycles);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READ * 0U + 2U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_READ_SDR, address_pads, 0x04, 0, 0, 0);
            }

            if (support_ddr_mode)
            {
                config->halfClkForNonReadCmd = true;
                config->controllerMiscOption |= (0x01UL << kFlexSpiMiscOffset_DdrModeEnable);
            }
        }
        else
        {
            /* Force transfer rate as DDR if serial nor flash support octal DDR mode. */
            if (support_ddr_mode)
            {
                config->transferMode = kSerialNorTransferMode_DDR;
            }
            else
            {
                config->transferMode = kSerialNorTransferMode_SDR;
            }

            /* read fast(8-8-8) command from SFDP information */
            uint8_t readCmd = xspi_profile_1_tb1->cmd_8d_8d_8d_mode_info.read_fast_cmd;

