OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
            /* Update write enable LUT table and current command mode for octal sdr mode */
            (void)memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 0, 4 * 4);
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0);
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITEENABLE * 4U,
                              &config->lookupTable[4 * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 4);

            /* Set the command instruction of write configuration register 2 for LUT in octal sdr mode. */
            (void)memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x31, kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_8PAD, 0x01);
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

            (void)FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

            flashXfer.deviceAddress = 0;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Write;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;
            flashXfer.data          = &enableDdrMode;
            flashXfer.dataSize      = 1;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

            if (status != kStatus_Success)
            {
                return status;
            }

            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);

            /* Update command mode into 8d-8d-8d */
            config->CurrentCommandMode = kSerialNorCommandMode_8d_8d_8d;
        }
    }
    else
    {
        /* TODO: for x_x1xxb with write config register 2 */
        status = kStatus_FLEXSPINOR_UnsupportedOctalModeEnterMethod;
    }

    if (kStatus_Success == status)
    {
        status = FLEXSPI_NOR_CheckCommandModeAvailability(handle, config, tbl);
    }

    return status;
}

/*
 * Probe API only supports change from octal mode into standard SPI mode currently.
 * TBD: will support from quad mode.
 */
static status_t FLEXSPI_NOR_ProbeCommandMode(nor_handle_t *handle, flexspi_mem_config_t *config)
{
    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    uint8_t i;
    sfdp_header_t sfdp_header;
    jedec_info_table_t tbl;

    /*
     * Read SFDP command protocol based on JESD216C/D
     *
     * The Read SFDP command can be used with devices supporting modes of (1-1-1), (2-2-2), (4-4-4), or (4S-4D-4D),
     * but the instruction (5Ah), address (24 bits), eight wait states, and 50 MHz requirements remain the same.
     */
    const lut_seq_t k_sdfp_lut[1] = {
        /* Read SFDP LUT sequence for 1 pad instruction. */
        {{FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialFlash_ReadSFDP, kFLEXSPI_Command_RADDR_SDR,
                          kFLEXSPI_1PAD, 24),
          FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_1PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0xFF),
          0, 0}}};
    /* Zero initialization */
    (void)memset(&sfdp_header, 0, sizeof(sfdp_header));

    for (i = 0U; i < (uint8_t)kSerialNorCommandMode_max; i++)
    {
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READ_SFDP * 4U,
                          (const uint32_t *)&k_sdfp_lut[0], 4);

        status = FLEXSPI_NOR_ReadSFDP((FLEXSPI_Type *)handle->driverBaseAddr, 0, (uint32_t *)&sfdp_header,
                                      sizeof(sfdp_header));
        if (status != kStatus_Success)
        {
            status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
        }

        if (sfdp_header.signature != SFDP_JESD216_SIGNATURE || sfdp_header.major_rev != SFDP_JESD216_MAJOR)
        {
            /* Exit octal command mode */
            if ((i == (uint8_t)kSerialNorCommandMode_8d_8d_8d) || (i == (uint8_t)kSerialNorCommandMode_8s_8s_8s))
            {
                /*
                 * There are two methods to change from octal mode(8-8-8) into standard SPI mode(1-1-1) based on
                 * JESD216C/D spec. First method: Issue the Soft Reset 66/99 sequence, which is named as software reset
                 * and any on-going internal operations will be terminated and the device will return to its default
                 * power-on state(The device will always revert back to Standard SPI Mode after a Reset) and lose all
                 * the current volatile settings. Second method: Issue instruction 06h (WREN), then issue FFh
                 * instruction.
                 */
                tbl.basic_flash_param_tbl.mode_8_8_info.mode_8s_8s_8s_disable_seq = 0x08U;

                do
                {
                    config->CurrentCommandMode = kSerialNorCommandMode_8d_8d_8d;

                    /*
                     * Revert back to standard SPI mode
                     *
                     * Data corruption may happen if there is an on-going or suspended internal Erase or Program
                     * operation in progress when a software reset instruction sequence(First Method back to standard
                     * SPI mode) is accepted by device.
                     */
                    /* TBD: It is recommended to check the RDY/BSY bit in Status Register Byte 1 and the PS and ES bits
                       in Status Register Byte 2 before issuing the Reset instruction sequence. */
                    status = FLEXSPI_NOR_MacronixExitOctalMode(handle, config, &tbl);

                    if (status != kStatus_Success)
                    {
                        tbl.basic_flash_param_tbl.mode_8_8_info.mode_8s_8s_8s_disable_seq = 0x01U;
                    }

